{"format": "graph-model", "generatedBy": "2.3.0", "convertedBy": "TensorFlow.js Converter v2.7.0", "userDefinedMetadata": {"signature": {"inputs": {"conv2d_input:0": {"name": "conv2d_input:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "7"}, {"size": "6"}, {"size": "1"}]}}}, "outputs": {"Identity:0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "1"}]}}}}}, "modelTopology": {"node": [{"name": "unknown", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "4"}, {"size": "1"}, {"size": "16"}]}}}}}, {"name": "unknown_0", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/flatten/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "unknown_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "192"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_3", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}, {"size": "1"}]}}}}}, {"name": "unknown_4", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv2d_input", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "7"}, {"size": "6"}, {"size": "1"}]}}}}, {"name": "StatefulPartitionedCall/sequential/conv2d/Relu", "op": "_FusedConv2D", "input": ["conv2d_input", "unknown", "unknown_0"], "device": "/device:CPU:0", "attr": {"fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "explicit_paddings": {"list": {}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "data_format": {"s": "TkhXQw=="}, "padding": {"s": "VkFMSUQ="}, "use_cudnn_on_gpu": {"b": true}, "T": {"type": "DT_FLOAT"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/sequential/flatten/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/sequential/conv2d/Relu", "StatefulPartitionedCall/sequential/flatten/Const"], "attr": {"Tshape": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/dense/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential/flatten/Reshape", "unknown_1", "unknown_2"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}, "num_args": {"i": "1"}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "epsilon": {"f": 0.0}}}, {"name": "StatefulPartitionedCall/sequential/dense_1/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential/dense/Relu", "unknown_3", "unknown_4"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "transpose_b": {"b": false}, "transpose_a": {"b": false}, "epsilon": {"f": 0.0}, "num_args": {"i": "1"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/sequential/dense_1/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 440}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "unknown", "shape": [4, 4, 1, 16], "dtype": "float32"}, {"name": "unknown_0", "shape": [16], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential/flatten/Const", "shape": [2], "dtype": "int32"}, {"name": "unknown_1", "shape": [192, 32], "dtype": "float32"}, {"name": "unknown_2", "shape": [32], "dtype": "float32"}, {"name": "unknown_3", "shape": [32, 1], "dtype": "float32"}, {"name": "unknown_4", "shape": [1], "dtype": "float32"}]}]}